sterentev/atdf-device-asm-include/inc/AT90PWM81.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	ICR1		= 0x8C		; [MEMORY MAPPED] Timer/Counter1 Input Capture Register Bytes
.equ	TCCR1B		= 0x8A		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	EICRA		= 0x89		; [MEMORY MAPPED] External Interrupt Control Register A
.equ	OSCCAL		= 0x88		; [MEMORY MAPPED] Oscillator Calibration Value
.equ	PLLCSR		= 0x87		; [MEMORY MAPPED] PLL Control And Status Register
.equ	PRR		= 0x86		; [MEMORY MAPPED] Power Reduction Register
.equ	CLKSELR		= 0x85		; [MEMORY MAPPED] 
.equ	CLKCSR		= 0x84		; [MEMORY MAPPED] 
.equ	CLKPR		= 0x83		; [MEMORY MAPPED] 
.equ	WDTCSR		= 0x82		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	BGCCR		= 0x81		; [MEMORY MAPPED] BandGap Current Calibration Register
.equ	BGCRR		= 0x80		; [MEMORY MAPPED] BandGap Resistor Calibration Register
.equ	AC3CON		= 0x7F		; [MEMORY MAPPED] Analog Comparator3 Control Register
.equ	AC2CON		= 0x7E		; [MEMORY MAPPED] Analog Comparator 2 Control Register
.equ	AC1CON		= 0x7D		; [MEMORY MAPPED] Analog Comparator 1 Control Register
.equ	AC3ECON		= 0x7C		; [MEMORY MAPPED] 
.equ	AC2ECON		= 0x7B		; [MEMORY MAPPED] 
.equ	AC1ECON		= 0x7A		; [MEMORY MAPPED] 
.equ	AMP0CSR		= 0x79		; [MEMORY MAPPED] 
.equ	DIDR1		= 0x78		; [MEMORY MAPPED] Digital Input Disable Register 1
.equ	DIDR0		= 0x77		; [MEMORY MAPPED] Digital Input Disable Register 0
.equ	DACON		= 0x76		; [MEMORY MAPPED] DAC Control Register
.equ	PASDLY2		= 0x71		; [MEMORY MAPPED] Analog Synchronization Delay Register
.equ	PCNFE2		= 0x70		; [MEMORY MAPPED] PSC 2 Enhanced Configuration Register
.equ	POM2		= 0x6F		; [MEMORY MAPPED] PSC 2 Output Matrix
.equ	PSOC2		= 0x6E		; [MEMORY MAPPED] PSC2 Synchro and Output Configuration
.equ	PICR2		= 0x6C		; [MEMORY MAPPED] PSC 2 Input Capture Register
.equ	PSOC0		= 0x6A		; [MEMORY MAPPED] PSC0 Synchro and Output Configuration
.equ	PICR0		= 0x68		; [MEMORY MAPPED] PSC 0 Input Capture Register 
.equ	PFRC2B		= 0x67		; [MEMORY MAPPED] PSC 2 Input B Control
.equ	PFRC2A		= 0x66		; [MEMORY MAPPED] PSC 2 Input B Control
.equ	OCR2SA		= 0x64		; [MEMORY MAPPED] Output Compare SA Register 
.equ	PFRC0B		= 0x63		; [MEMORY MAPPED] PSC 0 Input B Control
.equ	PFRC0A		= 0x62		; [MEMORY MAPPED] PSC 0 Input A Control
.equ	OCR0SA		= 0x60		; [MEMORY MAPPED] Output Compare SA Register 
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	TCNT1		= 0x3A		; Timer/Counter1 Bytes
.equ	DAC		= 0x38		; DAC Data Register
.equ	SPMCSR		= 0x37		; Store Program Memory Control Register
.equ	SPDR		= 0x36		; SPI Data Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	OCR2RA		= 0x2E		; Output Compare RA Register 
.equ	ADC		= 0x2C		; ADC Data Register Bytes
.equ	OCR0RA		= 0x2A		; Output Compare RA Register 
.equ	OCR2RB		= 0x28		; Output Compare RB Register 
.equ	OCR2SB		= 0x26		; Output Compare SB Register 
.equ	OCR0RB		= 0x24		; Output Compare RB Register 
.equ	OCR0SB		= 0x22		; Output Compare SB Register 
.equ	EIMSK		= 0x21		; External Interrupt Mask Register
.equ	EIFR		= 0x20		; External Interrupt Flag Register
.equ	EEAR		= 0x1E		; EEPROM Read/Write Access Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	GPIOR2		= 0x1B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x1A		; General Purpose IO Register 1
.equ	GPIOR0		= 0x19		; General Purpose IO Register 0
.equ	SPSR		= 0x18		; SPI Status Register
.equ	SPCR		= 0x17		; SPI Control Register
.equ	PCTL2		= 0x16		; PSC 2 Control Register
.equ	PCNF2		= 0x15		; PSC 2 Configuration Register
.equ	PIFR2		= 0x14		; PSC2 Interrupt Flag Register
.equ	PIM2		= 0x13		; PSC2 Interrupt Mask Register
.equ	PCTL0		= 0x12		; PSC 0 Control Register
.equ	PCNF0		= 0x11		; PSC 0 Configuration Register
.equ	PIFR0		= 0x10		; PSC0 Interrupt Flag Register
.equ	PIM0		= 0x0F		; PSC0 Interrupt Mask Register
.equ	PORTE		= 0x0E		; Port E Data Register
.equ	DDRE		= 0x0D		; Port E Data Direction Register
.equ	PINE		= 0x0C		; Port E Input Pins
.equ	PORTD		= 0x0B		; Port D Data Register
.equ	DDRD		= 0x0A		; Port D Data Direction Register
.equ	PIND		= 0x09		; Port D Input Pins
.equ	ADMUX		= 0x08		; The ADC multiplexer Selection Register
.equ	ADCSRB		= 0x07		; ADC Control and Status Register B
.equ	ADCSRA		= 0x06		; The ADC Control and Status register
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	TIFR1		= 0x02		; Timer/Counter Interrupt Flag register
.equ	TIMSK1		= 0x01		; Timer/Counter Interrupt Mask Register
.equ	ACSR		= 0x00		; Analog Comparator Status Register


; ====	DAC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register DAC bits		------------------------
.equ	DACH_MASK	= 0x03FF	;      - DAC Data Register Bits (10 bits)
.equ	DACH0		= 0		;          DACH BIT0 position

; ----------	Register DACON bits		------------------------
.equ	DAATE		= 7		; 0x80 - DAC Auto Trigger Enable Bit
.equ	DATS_MASK	= 0x70		;      - DAC Trigger Selection Bits (3 bits)
.equ	DATS0		= 4		;          DATS BIT0 position
.equ	DALA		= 2		; 0x04 - DAC Left Adjust
.equ	DAEN		= 0		; 0x01 - DAC Enable Bit
; ::::  DATS	:::: bitfield values
;			0x00		; Analog Comparator 0
;			0x10		; Analog Comparator 1
;			0x20		; External Interrupt Request 0
;			0x30		; Timer/Counter0 Compare Match A
;			0x40		; Timer/Counter0 Overflow
;			0x50		; Timer/Counter1 Compare Match B
;			0x60		; Timer/Counter1 Overflow
;			0x70		; Timer/Counter1 Capture Event



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

