sterentev/atdf-device-asm-include/inc/AT90PWM81.inc
; ====	PSC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PICR0 bits		------------------------
.equ	PCST0		= 15		; 0x8000 - PSC 0 Capture Software Trigger Bit
.equ	PICR0_MASK	= 0x0FFF	;      - PSC 0 Input Capture Bytes (12 bits)
.equ	PICR00		= 0		;          PICR0 BIT0 position

; ----------	Register PFRC0B bits		------------------------
.equ	PCAE0B		= 7		; 0x80 - PSC 0 Capture Enable Input Part B
.equ	PISEL0B		= 6		; 0x40 - PSC 0 Input Select for Part B
.equ	PELEV0B		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part B
.equ	PFLTE0B		= 4		; 0x10 - PSC 0 Filter Enable on Input Part B
.equ	PRFM0B_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM0B0		= 0		;          PRFM0B BIT0 position

; ----------	Register PFRC0A bits		------------------------
.equ	PCAE0A		= 7		; 0x80 - PSC 0 Capture Enable Input Part A
.equ	PISEL0A		= 6		; 0x40 - PSC 0 Input Select for Part A
.equ	PELEV0A		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part A
.equ	PFLTE0A		= 4		; 0x10 - PSC 0 Filter Enable on Input Part A
.equ	PRFM0A_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM0A0		= 0		;          PRFM0A BIT0 position

; ----------	Register PCTL0 bits		------------------------
.equ	PPRE0_MASK	= 0xC0		;      - PSC 0 Prescaler Selects (2 bits)
.equ	PPRE00		= 6		;          PPRE0 BIT0 position
.equ	PBFM0_MASK	= 0x24		;      - PSC 0 Balance Flank Width Modulation (2 bits)
.equ	PAOC0B		= 4		; 0x10 - PSC 0 Asynchronous Output Control B
.equ	PAOC0A		= 3		; 0x08 - PSC 0 Asynchronous Output Control A
.equ	PCCYC0		= 1		; 0x02 - PSC0 Complete Cycle
.equ	PRUN0		= 0		; 0x01 - PSC 0 Run

; ----------	Register PCNF0 bits		------------------------
.equ	PFIFTY0		= 7		; 0x80 - PSC 0 Fifty
.equ	PALOCK0		= 6		; 0x40 - PSC 0 Autolock
.equ	PLOCK0		= 5		; 0x20 - PSC 0 Lock
.equ	PMODE0_MASK	= 0x18		;      - PSC 0 Mode (2 bits)
.equ	PMODE00		= 3		;          PMODE0 BIT0 position
.equ	POP0		= 2		; 0x04 - PSC 0 Output Polarity
.equ	PCLKSEL0	= 1		; 0x02 - PSC 0 Input Clock Select

; ----------	Register OCR0RB bits		------------------------
.equ	OCR0RB_MASK	= 0xFFFF	;      - Output Compare 0 RB (16 bits)
.equ	OCR0RB0		= 0		;          OCR0RB BIT0 position

; ----------	Register OCR0SB bits		------------------------
.equ	OCR0SB_MASK	= 0x0FFF	;      - Output Compare 0 SB (12 bits)
.equ	OCR0SB0		= 0		;          OCR0SB BIT0 position

; ----------	Register OCR0RA bits		------------------------
.equ	OCR0RA_MASK	= 0x0FFF	;      - Output Compare 0 RA (12 bits)
.equ	OCR0RA0		= 0		;          OCR0RA BIT0 position

; ----------	Register OCR0SA bits		------------------------
.equ	OCR0SA_MASK	= 0x0FFF	;      - Output Compare 0 SA (12 bits)
.equ	OCR0SA0		= 0		;          OCR0SA BIT0 position

; ----------	Register PSOC0 bits		------------------------
.equ	PISEL0A1	= 7		; 0x80 - PSC Input Select
.equ	PISEL0B1	= 6		; 0x40 - PSC Input Select
.equ	PSYNC0_MASK	= 0x30		;      - Synchronisation out for ADC selection (2 bits)
.equ	PSYNC00		= 4		;          PSYNC0 BIT0 position
.equ	POEN0B		= 2		; 0x04 - PSCOUT01 Output Enable
.equ	POEN0A		= 0		; 0x01 - PSCOUT00 Output Enable

; ----------	Register PIM0 bits		------------------------
.equ	PEVE0B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE0A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOEPE0		= 1		; 0x02 - End of Enhanced Cycle Enable
.equ	PEOPE0		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR0 bits		------------------------
.equ	POAC0B		= 7		; 0x80 - PSC 0 Output A Activity
.equ	POAC0A		= 6		; 0x40 - PSC 0 Output A Activity
.equ	PEV0B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV0A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN0_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN00		= 1		;          PRN0 BIT0 position
.equ	PEOP0		= 0		; 0x01 - End of PSC0 Interrupt

; ----------	Register PICR2 bits		------------------------
.equ	PCST2		= 15		; 0x8000 - PSC 2 Capture Software Trigger Bit
.equ	PICR2_MASK	= 0x0FFF	;      - PSC 2 Input Capture Bytes (12 bits)
.equ	PICR20		= 0		;          PICR2 BIT0 position

; ----------	Register PFRC2B bits		------------------------
.equ	PCAE2B		= 7		; 0x80 - PSC 2 Capture Enable Input Part B
.equ	PISEL2B		= 6		; 0x40 - PSC 2 Input Select for Part B
.equ	PELEV2B		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part B
.equ	PFLTE2B		= 4		; 0x10 - PSC 2 Filter Enable on Input Part B
.equ	PRFM2B_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM2B0		= 0		;          PRFM2B BIT0 position

; ----------	Register PFRC2A bits		------------------------
.equ	PCAE2A		= 7		; 0x80 - PSC 2 Capture Enable Input Part A
.equ	PISEL2A		= 6		; 0x40 - PSC 2 Input Select for Part A
.equ	PELEV2A		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part A
.equ	PFLTE2A		= 4		; 0x10 - PSC 2 Filter Enable on Input Part A
.equ	PRFM2A_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM2A0		= 0		;          PRFM2A BIT0 position

; ----------	Register PCTL2 bits		------------------------
.equ	PPRE2_MASK	= 0xC0		;      - PSC 2 Prescaler Selects (2 bits)
.equ	PPRE20		= 6		;          PPRE2 BIT0 position
.equ	PBFM2		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC2B		= 4		; 0x10 - PSC 2 Asynchronous Output Control B
.equ	PAOC2A		= 3		; 0x08 - PSC 2 Asynchronous Output Control A
.equ	PARUN2		= 2		; 0x04 - PSC2 Auto Run
.equ	PCCYC2		= 1		; 0x02 - PSC2 Complete Cycle
.equ	PRUN2		= 0		; 0x01 - PSC 2 Run

; ----------	Register PCNF2 bits		------------------------
.equ	PFIFTY2		= 7		; 0x80 - PSC 2 Fifty
.equ	PALOCK2		= 6		; 0x40 - PSC 2 Autolock
.equ	PLOCK2		= 5		; 0x20 - PSC 2 Lock
.equ	PMODE2_MASK	= 0x18		;      - PSC 2 Mode (2 bits)
.equ	PMODE20		= 3		;          PMODE2 BIT0 position
.equ	POP2		= 2		; 0x04 - PSC 2 Output Polarity
.equ	PCLKSEL2	= 1		; 0x02 - PSC 2 Input Clock Select
.equ	POME2		= 0		; 0x01 - PSC 2 Output Matrix Enable

; ----------	Register PCNFE2 bits		------------------------
.equ	PASDLK2_MASK	= 0xE0		;      -  (3 bits)
.equ	PASDLK20	= 5		;          PASDLK2 BIT0 position
.equ	PBFM21		= 4		; 0x10 - 
.equ	PELEV2A1	= 3		; 0x08 - 
.equ	PELEV2B1	= 2		; 0x04 - 
.equ	PISEL2A1	= 1		; 0x02 - 
.equ	PISEL2B1	= 0		; 0x01 - 

; ----------	Register OCR2RB bits		------------------------
.equ	OCR2RB_MASK	= 0xFFFF	;      - Output Compare 2 RB (16 bits)
.equ	OCR2RB0		= 0		;          OCR2RB BIT0 position

; ----------	Register OCR2SB bits		------------------------
.equ	OCR2SB_MASK	= 0x0FFF	;      - Output Compare 2 SB (12 bits)
.equ	OCR2SB0		= 0		;          OCR2SB BIT0 position

; ----------	Register OCR2RA bits		------------------------
.equ	OCR2RA_MASK	= 0x0FFF	;      - Output Compare 2 RA (12 bits)
.equ	OCR2RA0		= 0		;          OCR2RA BIT0 position

; ----------	Register OCR2SA bits		------------------------
.equ	OCR2SA_MASK	= 0x0FFF	;      - Output Compare 2 SA (12 bits)
.equ	OCR2SA0		= 0		;          OCR2SA BIT0 position

; ----------	Register POM2 bits		------------------------
.equ	POMV2B_MASK	= 0xF0		;      - Output Matrix Output B Ramps (4 bits)
.equ	POMV2B0		= 4		;          POMV2B BIT0 position
.equ	POMV2A_MASK	= 0x0F		;      - Output Matrix Output A Ramps (4 bits)
.equ	POMV2A0		= 0		;          POMV2A BIT0 position

; ----------	Register PSOC2 bits		------------------------
.equ	POS2_MASK	= 0xC0		;      - PSC 2 Output 23 Select (2 bits)
.equ	POS20		= 6		;          POS2 BIT0 position
.equ	PSYNC2_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC20		= 4		;          PSYNC2 BIT0 position
.equ	POEN2D		= 3		; 0x08 - PSCOUT23 Output Enable
.equ	POEN2B		= 2		; 0x04 - PSCOUT21 Output Enable
.equ	POEN2C		= 1		; 0x02 - PSCOUT22 Output Enable
.equ	POEN2A		= 0		; 0x01 - PSCOUT20 Output Enable

; ----------	Register PIM2 bits		------------------------
.equ	PSEIE2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt Enable
.equ	PEVE2B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE2A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOEPE2		= 1		; 0x02 - End of Enhanced Cycle Interrupt Enable
.equ	PEOPE2		= 0		; 0x01 - End of Cycle Interrupt Enable

